#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/rdcresume/resume-frontend/runs/run-SRzNzrjPo9f2yvR7

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_s3_bucket.crchost2: Refreshing state... [id=crchost2]
aws_s3_bucket_ownership_controls.open: Refreshing state... [id=crchost2]
aws_s3_bucket_policy.allow_access_from_another_account: Refreshing state... [id=crchost2]
aws_s3_bucket_public_access_block.publicAccess: Refreshing state... [id=crchost2]
aws_s3_bucket_website_configuration.Resume: Refreshing state... [id=crchost2]
aws_s3_object.object: Refreshing state... [id=Resume.html]
aws_s3_bucket_policy.allow_access_from_another_account: Drift detected (delete)
aws_s3_bucket_public_access_block.publicAccess: Drift detected (delete)
aws_s3_bucket_website_configuration.Resume: Drift detected (delete)
aws_s3_object.object: Drift detected (delete)
aws_s3_bucket.crchost2: Drift detected (delete)
aws_s3_bucket_ownership_controls.open: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_s3_bucket.crchost2 has been deleted
  - resource "aws_s3_bucket" "crchost2" {
      - id                          = "crchost2" -> null
        tags                        = {}
        # (10 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.crchost2 will be created
  + resource "aws_s3_bucket" "crchost2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "crchost2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.open will be created
  + resource "aws_s3_bucket_ownership_controls" "open" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.allow_access_from_another_account will be created
  + resource "aws_s3_bucket_policy" "allow_access_from_another_account" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.publicAccess will be created
  + resource "aws_s3_bucket_public_access_block" "publicAccess" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # aws_s3_bucket_website_configuration.Resume will be created
  + resource "aws_s3_bucket_website_configuration" "Resume" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "Resume.html"
        }
    }

  # aws_s3_object.object will be created
  + resource "aws_s3_object" "object" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "Resume.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./BucketItems/Resume.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # random_pet.sg will be created
  + resource "random_pet" "sg" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @RyanChris95, Action: `pull_request`*